node {
  name: "input_tensor"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 256
        }
        dim {
          size: 512
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "binary_input_label"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 256
        }
        dim {
          size: 512
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "instance_input_label"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 256
        }
        dim {
          size: 512
        }
      }
    }
  }
}
node {
  name: "net_phase"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "train"
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "test"
      }
    }
  }
}
node {
  name: "Equal"
  op: "Equal"
  input: "net_phase"
  input: "Const"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.31031644344329834
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal/TruncatedNormal"
  input: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/W"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal"
  op: "Add"
  input: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal/mul"
  input: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/W"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/W"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/W"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/W/Assign"
  op: "Assign"
  input: "lanenet_loss/inference/encode/conv1/W"
  input: "lanenet_loss/inference/encode/conv1/W/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/W"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/W/read"
  op: "Identity"
  input: "lanenet_loss/inference/encode/conv1/W"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/W"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/Conv2D"
  op: "Conv2D"
  input: "input_tensor"
  input: "lanenet_loss/inference/encode/conv1/W/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/conv1/conv1"
  op: "Identity"
  input: "lanenet_loss/inference/encode/conv1/Conv2D"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/Switch"
  op: "Switch"
  input: "Equal"
  input: "Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/switch_t"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/switch_f"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  op: "Identity"
  input: "Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta/Assign"
  op: "Assign"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta/read"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/Const"
  op: "Const"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean/Assign"
  op: "Assign"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean/read"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance/Assign"
  op: "Assign"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance/read"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/Const_1"
  op: "Const"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/Const_2"
  op: "Const"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/FusedBatchNorm/Switch:1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/Const"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/FusedBatchNorm/Switch_1:1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/Const_1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/FusedBatchNorm/Switch"
  op: "Switch"
  input: "lanenet_loss/inference/encode/conv1/conv1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/conv1"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta/read"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg/decay"
  op: "Const"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg/sub"
  op: "Sub"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg/sub/Switch:1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/FusedBatchNorm:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean/read"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg/mul"
  op: "Mul"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg/sub"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg"
  op: "AssignSub"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg/Switch:1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg/Switch"
  op: "RefSwitch"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1/decay"
  op: "Const"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1/sub/Switch:1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/FusedBatchNorm:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1/sub/Switch"
  op: "Switch"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance/read"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1/sub"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1"
  op: "AssignSub"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1/Switch:1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1/Switch"
  op: "RefSwitch"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/Identity"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/FusedBatchNorm"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/AssignMovingAvg_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/Const"
  op: "Const"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/FusedBatchNorm/Switch"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/Const"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/FusedBatchNorm/Switch_1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/FusedBatchNorm/Switch_2"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/FusedBatchNorm/Switch_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/FusedBatchNorm/Switch"
  op: "Switch"
  input: "lanenet_loss/inference/encode/conv1/conv1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/conv1/conv1"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta/read"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/beta"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean/read"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/FusedBatchNorm/Switch_3"
  op: "Switch"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance/read"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/Merge"
  op: "Merge"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1_1/FusedBatchNorm"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/bn_1/Identity"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/relu_1"
  op: "Relu"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000\020\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.40311288833618164
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal/TruncatedNormal"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal"
  op: "Add"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal/mul"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 16
        }
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Assign"
  op: "Assign"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/read"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/Conv2D"
  op: "Conv2D"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/relu_1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/W/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/conv_1"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/conv_1/Conv2D"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/Switch"
  op: "Switch"
  input: "Equal"
  input: "Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/switch_t"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/switch_f"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/pred_id"
  op: "Identity"
  input: "Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta/Assign"
  op: "Assign"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta/read"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/beta"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/bn_2/Const"
  op: "Const"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean/Assign"
  op: "Assign"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean/read"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_mean"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance/Assign"
  op: "Assign"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance/read"
  op: "Identity"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/bn_2/moving_variance"
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/bn_2/Const_1"
  op: "Const"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/bn_2/Const_2"
  op: "Const"
  input: "^lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/bn_2/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/bn_2/FusedBatchNorm/Switch:1"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/bn_2/Const"
  input: "lanenet_loss/inference/encode/Dense_Block_1/Dense_Block_1_layer_1/composite_conv/cond_1/bn_2/FusedBatchNorm/Switch_1:1"
